In [1]:
import pandas as pd 
import numpy as np

In [2]:
people = {
    'first': ['Corey' , 'Jane' , 'John' , 'Chris' , np.nan ,None , 'NA'],
    'last': ['Schafer' , 'Doe' , 'Doe' , 'Schafer' , np.nan , np.nan , 'Missing'],
    'email': ['coreyMSchafer@gmail.com' , 'JaneDoe@gmail.com', 'JohnDoe@gmail.com' , None, np.nan ,'Anonymous@gmail.com','NA' ],
    'age': ['33' , '55' ,'63' , '36' , None , None , 'Missing']
}

In [5]:
df = pd.DataFrame(people)
df.replace('NA' , np.nan , inplace=True)
df.replace('Missing' , np.nan , inplace=True)

In [6]:
df

   first     last                    email   age
0  Corey  Schafer  coreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@gmail.com  None
6    NaN      NaN                      NaN   NaN

In [7]:
df.dropna()

   first     last                    email age
0  Corey  Schafer  coreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@gmail.com  55
2   John      Doe        JohnDoe@gmail.com  63

In [8]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

here let us assume that we are calculating the marks of the students of assignments and basically some of the values are NA basically they have not submitted their assignments so we want to put those NA as 0 so in this situation we can use fillna() method

In [9]:
df.fillna('MISSING')

     first     last                    email      age
0    Corey  Schafer  coreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@gmail.com       55
2     John      Doe        JohnDoe@gmail.com       63
3    Chris  Schafer                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING      Anonymous@gmail.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [10]:
df.fillna(0)

   first     last                    email age
0  Corey  Schafer  coreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@gmail.com  55
2   John      Doe        JohnDoe@gmail.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@gmail.com   0
6      0        0                        0   0

# Casting datatypes

In [11]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [ ]:
df['age'].mean()
# here basically the error occured because here these are string values not an integer value and string value mean cannot be calculated so we need to convert it to string 
# when we are taking NaN values we need to take it float as they are float under the hood 
# basically that means we do not need to convert it to int we need to convert it to string

TypeError: can only concatenate str (not "int") to str

In [14]:
type(np.nan)

float

In [16]:
df['age'] = df['age'].astype(float)
df['age'].mean()

np.float64(46.75)

basically what we got to know is that when we have missing values we have a option that we can convert those missing values as 0 then convert them to int and then we can find out the mean but else we need to make them as float as Nan values are float

In [17]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object